rails/full_stack/app/controllers/herb_controller.rb

  def index
    @herbs = Herb.all
---
SELECT "herbs".* FROM "herbs"

  def show
    @herb = Herb.find(params[:id])
---
SELECT "herbs".* FROM "herbs" WHERE "herbs"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def create
    @herb = Herb.create(herb_params)
---
INSERT INTO "herbs" ("name", "is_watered", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Test"], ["is_watered", "no"], ["created_at", "2020-12-10 23:35:48.095430"], ["updated_at", "2020-12-10 23:35:48.095430"]]

  def destroy
    @herb = Herb.find(params[:id])
    if @herb.destroy
---
SELECT "herbs".* FROM "herbs" WHERE "herbs"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "herbs" WHERE "herbs"."id" = $1  [["id", 4]]

  def edit
    @herb = Herb.find(params[:id])
---
SELECT "herbs".* FROM "herbs" WHERE "herbs"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]

  def update
    @herb = Herb.find(params[:id])
    @herb.update(herb_params)
---
SELECT "herbs".* FROM "herbs" WHERE "herbs"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "herbs" SET "name" = $1, "is_watered" = $2, "updated_at" = $3 WHERE "herbs"."id" = $4  [["name", "Cilantros"], ["is_watered", "no"], ["updated_at", "2020-12-11 00:05:07.203984"], ["id", 5]]